
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Podaj nazwę i hasło użytkownika, by uzyskać dostęp do źródeł RSS.";
"kLoginInitialMessage"      = "Aby mieć dostęp do źródeł RSS „%@”, należy zalogować się w obszarze „%@” na %@. Twoje hasło będzie wysłane jawnym tekstem.\n";
"kLoginFailedMessage"       = "Logowanie nie powiodło się. Proszę ponownie podać nazwę użytkownika i hasło w obszarze „%@” na %@.\n";
"kLoginUsernameField"       = "Nazwa:";
"kLoginPasswordField"       = "Hasło:";
"kLoginLogInButton"         = "Zaloguj się";
"kLoginCancelButton"        = "Anuluj";
"kLoginSavePasswordCheckbox"= "Pamiętaj to hasło w moim pęku kluczy";


/* Error Messages */

"PSInternalErrorDescription"        = "Wystąpił błąd wewnętrzny w szablonie Publication Subscription.";
"PSInternalErrorFailureReason"      = "Wystąpił błąd wewnętrzny w szablonie Publication Subscription.";
"PSInternalErrorRecoverySuggestion" = "Proszę, wyloguj i spróbuj ponownie.";

"PSPublishSettingsErrorDescription"        = "Źródła nie mogły być opublikowane, gdyż ustawienia publikowania są nieprawidłowe.";
"PSPublishSettingsErrorFailureReason"      = "Ustawienia publikowania są nieprawidłowe.";
"PSPublishSettingsErrorRecoverySuggestion" = "Proszę sprawdzić ustawienia publikowania i spróbować ponownie.";

"PSNotAFeedErrorDescription"        = "Źródła nie mogły być wczytane, gdyż są w nieznanym formacie.";
"PSNotAFeedErrorFailureReason"      = "Zawartość źródeł jest w nieznanym formacie.";
"PSNotAFeedErrorRecoverySuggestion" = "Proszę sprawdzić, czy pod wskazanym adresem znajdują się źródła w formacie Atom lub RSS.";

"PSUnsupportedPermissionsErrorDescription"          = "Źródła nie mogły być opublikowane, gdyż ten typ uprawnień nie jest obsługiwany.";
"PSUnsupportedPermissionsErrorFailureReason"        = "Ten typ uprawnień nie jest obsługiwany.";
"PSUnsupportedPermissionsErrorRecoverySuggestion"   = "Proszę sprawdzić typ uprawnień i spróbować ponownie.";

"PSUnsupportedIdentitiesErrorDescription"         = "Źródła nie mogły być opublikowane, gdyż ten typ jednostki nie jest obsługiwany.";
"PSUnsupportedIdentitiesErrorFailureReason"       = "Ten typ jednostki nie jest obsługiwany.";
"PSUnsupportedIdentitiesErrorRecoverySuggestion"  = "Proszę sprawdzić typ jednostki i spróbować ponownie.";

"NSURLErrorUserAuthenticationRequired Description" = "Wymagane są nazwa i hasło użytkownika";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Dzisiaj', h:mm";
"YesterdayFmt"  = "'Wczoraj', h:mm";
"ThisWeekFmt"   = "EEEE, h:mm";
"ThisYearFmt"   = "d MMM, h:mm";
"PastYearFmt"   = "d MMM yyyy, h:mm";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 bajtów";           /* String used for showing a zero byte size */
"1 byte"             = "1 bajt";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f bajtów";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f KB";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f KB";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f KB";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f KB";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f MB";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f MB";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f MB";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f GB";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f GB";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f GB";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "bez tytułu";   /* If we download and enclosure for which we have no other name to go by */
